{
  "id": "30007094-itt-en-final",
  "title": "30007094 ITT  EN Final",
  "procurement_method": "RFP",
  "buyer": {
    "name": "City of Calgary",
    "jurisdiction": "CA-municipal"
  },
  "industry_tags": [
    "it-services",
    "security"
  ],
  "summary": "RETURN BIDS to: RETOURNER LES SOUMISSIONS à Bid Receiving/Réception des soumissions Procurement Hub | Centre d’approvisionnement 200 Kent Street | 200 rue Kent Ottawa, ON, K1A 0E6 For documents sent…",
  "text": "RETURN BIDS to: \nRETOURNER LES SOUMISSIONS à  \n \nBid Receiving/Réception des soumissions \n \nProcurement Hub | Centre d’approvisionnement \n200 Kent Street | 200 rue Kent \nOttawa, ON, K1A 0E6 \n \nFor documents sent by mail please notify the \ncontracting authority via email (DFO.tenders-\nsoumissions.MPO@dfo-mpo.gc.ca) that you re \nsubmitting a document by mail. \n \nBy post, documents should be addressed to : \nName: Dina Al-Eryani  \n \n \nEmail : DFO.tenders-soumissions.MPO@dfo-\nmpo.gc.ca  \nAND \nDina.Al-Eryani@dfo-mpo.gc.ca \n \nBid documents and bid security received by \nfax will not be accepted. \n \nINVITATION TO TENDER \nAPPEL D’OFFRES \n \nProposal to: Fisheries and Oceans Canada \n \nWe hereby offer to sell to His Majesty the King in \nright of Canada, in accordance with the terms and \nconditions set out herein, referred to herein or \nattached hereto, the goods, services, and \nconstruction listed herein and on any attached \nsheets at the price(s) set out therefor. \n \nProposition à : Pêches et Océans Canada \n \nNous offrons par la présente de vendre à Sa \nMajesté le Roi du chef du Canada, aux conditions \nénoncées ou incluses par référence dans la \nprésente et aux appendices ci-jointes, les biens, \nles services, et construction  énumérés ici sur \ntoute feuille ci-annexée, au(x) prix indiqué(s). \n  \nTitle / Titre \nDevelopment of  Service Area in Kegaska Harbour,  Lower North Shore, \nQuebec  \nSolicitation No. / Nº de l’invitation \n30007094 \nDate \nJuly 17,  2025 \nClient Reference No. / No. de référence du client(e) \n30007094 \nSolicitation Closes / L’invitation prend fin \n \nAt /à :   2 : 00 PM \n \nEDT (Eastern Daylight Time) / HAE (Heure Avancée de l’Est) \n \nOn / le :   August 18, 2025 \nF.O.B. / F.A.B. \nDestination \nAddress Inquiries to : / Adresser toute demande de renseignements  à : \n \nDina Al-Eryani , Senior Contracting Officer / Agente principale des \ncontrats \nTelephone No. – No. De téléphone : 506-282-2340 \nEmail / Courriel: DFO.tenders-soumissions.MPO@dfo-mpo.gc.ca  \nCC : Dina.Al-Eryani@dfo-mpo.gc.ca \nDestination of Goods, Services, and Construction / Destination des biens, \nservices, et construction \n \n  Lower North Shore, Quebec  \n \n \nTO BE COMPLETED BY THE BIDDER (type of print) \n \nA ÊTRE COMPLÉTER PAR LE SOUMISSIONAIRE (taper ou écrire en \ncaractères d’imprimerie) \n \nVendor Name, Address and Representative / Nom du vendeur, adresse et \nreprésentant du fournisseur/de l’entrepreneur \n \n \nTelephone No. / No. de téléphone \n \nName and title of person authorized to sign on behalf of Vendor (type or \nprint) / Nom et titre de la personne autorisée à signer au nom du \nfournisseur (taper ou écrire en caractères d’imprimerie) \n \n \nSignature \n \n \n \nDate \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 2 of 32 \n \n \nINVITATION TO TENDER \n \nDevelopment of  Service Area in Kegaska Harbour \nLower North Shore, Quebec \n \n  \n \nIMPORTANT NOTICES TO BIDDERS \n \nPlease be advised that Fisheries and Oceans Canada (DFO) will be accepting Bid Bonds in Digital Bid Bond \nFormat. \n \nThese Digital Bid Bonds will need to be in an electronically verifiable/enforceable format. It is important to note \nthat a scanned and uploaded copy of a paper Bid Bond is not a Digital Bid Bond.  \n \nAll bid bonds must be irrevocable and open for bid acceptance for the time period outlined in the Bid \nDocument. \n \nAll references to the Department of Public Works & Government Services Canada (PWGSC) in the instructions, general \nterms, conditions and clauses identified in the Invitation to Tender (ITT) by number, date and title, are set out in the \nStandard Acquisition Clauses and Conditions Manual are to be replaced with Fisheries and Oceans Canada (DFO).   \n \nLISTING OF SUBCONTRACTORS  \n \nTake note that R2710T, GI07  “Listing of Subcontractors and Suppliers” has been amended. See SI15 of the Special \nInstructions. \n \nINTEGRITY PROVISIONS - BID \n \nChanges have been made to the Integrity Provisions – Bid.  Refer to section GI01 of the General Instructions. \n \nBID SUBMITTAL \n \nThe maximum size per email (including attachments) is limited to 10MB.   If the limit is exceeded, your email might not be \nreceived by DFO. It is suggested that you compress the email size to ensure delivery. Bidders are responsible to send their \nproposal and to allow enough time for DFO to receive the proposal by the closing period indicated in the ITT. Emails with \nlinks to bid documents will not be accepted.  \n  \nFor bids transmitted by email, DFO will not be responsible for any failure attributable to the transmission or receipt of the \nemail bid. DFO will send a confirmation email to the Bidders when the submission is received.  \n \nTECHNICAL DIFFICULTIES OF BID TRANSMISSION \n \nDespite anything to the contrary in (05), (06) or (08) of the Standard Instructions, where a Bidder has commenced \ntransmission of its bid through an electronic submission method (such as facsimile or Canada Post Corporation's (CPC) \nConnect service, or other online service) in advance of the bid solicitation closing date and time, but due to technical \ndifficulties, Canada was unable to receive or decode the entirety of the Bid by the deadline, Canada may nonetheless \naccept the entirety of the Bid received after the bid solicitation closing date and time, provided that the Bidder can \ndemonstrate the following: \n \ni. The bidder contacted Canada in advance of the bid solicitation closing date and time to attempt to resolve its \ntechnical difficulties; OR \n \nii. The electronic properties of the Bid documentation clearly indicate that all components of the Bid were prepared in \nadvance of the bid solicitation closing date and time. \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 3 of 32 \n \n \n \nCOMPLETENESS OF THE BID \n \nAfter the closing date and time of this bid solicitation, Canada will examine the Bid to determine completeness. The review \nfor completeness will be limited to identifying whether any information submitted as part of the bid can be accessed, \nopened, and/or decoded. This review does not constitute an evaluation of the content, will not assess whether the Bid \nmeets any standard or is responsive to all solicitation requirements, but will be solely limited to assessing completeness. \nCanada will provide the Bidder with the opportunity to submit information found to be missing or incomplete in this review \nwithin two business days of notice.  \n \nSpecifically, the submission will be reviewed and deemed complete when:  \n \n1- Certifications and securities required at bid closing are included.  \n2- Bids are properly signed, that the bidder is properly identified.  \n3- Acceptance of the terms and conditions of the bid solicitation and resulting contract. \n4- All documents created prior to bid closing but due to technical difficulties Canada was unable to receive them, have \nbeen properly submitted and received by Canada. \n5- All certifications, declarations and proofs created prior to bid closing but due to technical difficulties Canada was \nunable to receive them, have been properly submitted and received by Canada.  \n \n \nCOMPLETENESS OF THE BID CHECKLIST \nBids will be reviewed and deemed to be complete when the following elements have been submitted by the bidder:  \n \nComplete \n(Y/N)  Action Taken \n Certifications and securities required at bid closing are included.  \n Bids are properly signed, that the bidder is properly identified.  \n Acceptance of the terms and conditions of the bid solicitation and resulting contract. \n All documents created prior to bid closing but due to technical difficulties Canada was \nunable to receive them, have been properly submitted and received by Canada.  \n \nAll certifications, declarations and proofs created prior to bid closing but due to \ntechnical difficulties Canada was unable to receive them, have been properly \nsubmitted and received by Canada. \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 4 of 32 \n \nTABLE OF CONTENTS \n \nSPECIAL INSTRUCTIONS TO BIDDERS (SI)  \n \nSI01 Introduction \nSI02 Bid Documents \nSI03 Enquiries during the Solicitation Period \nSI04  No Site Visit \nSI05 Revision of Bid \nSI06 Opening of Bids \nSI07 Bid Results \nSI08 Office of  the Procurement Ombudsman (OPO) \nSI09 Insufficient Funding \nSI10 Bid Validity Period \nSI11 Rights of Canada \nSI12 Construction Documents \nSI13 Industrial Security Related Requirement  \nSI14 Integrity Provisions Bid Requirements \nSI15 Listing of Subcontractors \nSI16 Procurement Strategy for Indigenous Business  \nSI17 Web Sites \n \nGENERAL INSTRUCTIONS - CONSTRUCTION SERVICES - BID SECURITY REQUIREMENTS - R2710T (2022-\n12-01)   \n \nThe following GI’s are included by reference and are available in ANNEX E of this document \n \nGI01  Integrity Provisions - Bid  \nGI02  Completion of Bid  \nGI03  Identity or Legal Capacity of the Bidder  \nGI04  Applicable Taxes  \nGI05  Capital Development and Redevelopment Charges  \nGI06  Registry and Pre-qualification of Floating Plant  \nGI07  Listing of Subcontractors and Suppliers  \nGI08  Bid Security Requirements  \nGI09  Submission of Bid  \nGI10  Revision of Bid  \nGI11  Rejection of Bid  \nGI12  Bid Costs  \nGI13  Procurement Business Number  \nGI14  Compliance with Applicable Laws  \nGI15  Approval of Alternative Materials  \nGI16  Performance Evaluation  \nGI17  Conflict of Interest - Unfair Advantage  \nGI18  Code of Conduct for Procurement – Bid  \n \nCONTRACT DOCUMENTS (CD) \n \nSUPPLEMENTARY CONDITIONS (SC) \n \nSC01  Industrial Security Requirement for Canadian Contractors \nSC02 Insurance Terms \n \nBID AND ACCEPTANCE FORM (BA) \n \nBA01  Identification \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 5 of 32 \n \nBA02  Business Name and Address of Bidder \nBA03  The Offer \nBA04  Bid Validity Period \nBA05  Acceptance and Contract \nBA06  Construction Time \nBA07  Bid Security \nBA08 Electronic Payment of Invoices \nBA09 Signature  \n \nLIST OF ANNEXES AND APPENDICES:  \n \nAPPENDIX 1 - COMBINED PRICE FORM \nAPPENDIX 2 - INTEGRITY PROVISIONS   \nAPPENDIX 3 - LISTING OF SUBCONTRACTORS \n \nANNEX A - STATEMENT OF WORK  \nANNEX B - CERTIFICATE OF INSURANCE \nANNEX C - SPECIFICATIONS \nANNEX D - DRAWINGS, PLANS, PHOTOS, OTHERS  \nANNEX E – R2710 GENERAL INSTRUCTIONS – CONSTRUCTION SERICES – BID SECURITY \nREQUIREMENTS \n \n \n \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 6 of 32 \n \nSPECIAL INSTRUCTIONS TO BIDDERS (SI) \n \nSI01 INTRODUCTION \n \n1. Fisheries and Oceans Canada (DFO) intends to retain a Contractor to provide construction services for the project \nas set out in this Invitation to tender (ITT). \n \n2. Bidders responding to this ITT are requested to submit a full and complete quotation.  Refer to GI09 ‘Submission of \nBid’. \n \n3. Point 1 of Article GI09 of R2710T (2022-12-01) is replaced by the following: \n \nThe Bid and Acceptance Form, duly completed, and the bid security shall be submitted to the email address(es) \ndesignated on the Front Page \"Invitation to Tender\" for the receipt of bids. The bid must be received on or before \nthe date and time set for solicitation closing. \n \nSI02 BID DOCUMENTS \n \n1. The following are the Bid Documents: \n \na. Invitation to Tender - Page 1; \nb. Special Instructions to Bidders; \nc. General Instructions - Construction Services - Bid Security Requirements R2710T (2022-12-01);  \nd. Clauses & Conditions identified in “Contract Documents”; \ne. Drawings and Specifications; \nf. Bid and Acceptance Form and related Appendices; and \ng. Any amendment issued prior to solicitation closing. \n \nSubmission of a bid constitutes acknowledgement that the Bidder has read and agrees to be bound by these \ndocuments. \n \n2. General Instructions - Construction Services - Bid Security Requirements R2710T (2022-12-01) are incorporated by \nreference and is set out in the Standard Acquisition Clauses and Conditions (SACC) Manual, issued by Public \nWorks and Government Services Canada (PWGSC). The SACC Manual is available on the PWGSC Web site.  \n \n3. Bid documents and bid security must be submitted by email or mail to the address(es) and by the time indicated on \nthe cover page. Documents received by fax will not be accepted. Bid Security must be submitted as per GI08 “Bid \nSecurity Requirements”. No scanned copies or photocopies will be accepted. \n \n4. A bid bond may be submitted in a digital format if it meets the following criteria:  \n \n4.1. The version submitted by the Bidder must be verifiable by DFO with respect to the totality  and wholeness of \nthe bond form, including: the content; all digital signatures; all digital seals; with the surety Company, or an \napproved verification service provider of the Surety Company. \n \n4.2. The version submitted must be viewable, printable and storable in standard electronic file formats  acceptable \nto DFO, and in a single file. Allowable formats include digital pdf.  \n \n4.3. The verification may be conducted by DFO immediately or at any time during the life of the  bond and at the \ndiscretion of DFO with no requirement for passwords or fees.  \n \n4.4. The results of the verification must provide a clear, immediate and printable indication of pass or fail  regarding \nItem 4.1. \n \nBonds failing the verification process will NOT be considered to be valid.  \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 7 of 32 \n \nBonds passing the verification process will be treated as original and authentic.  \n \nSI03 ENQUIRIES DURING THE SOLICITATION PERIOD \n \n1. Enquiries regarding this bid must be submitted in writing to the Contracting Officer named on the Invitation to \nTender - Page 1 as early as possible within the solicitation period. Except for the approval of alternative \nmaterials as described in GI15 - Approval of alternative materials of R2710T (2022-12-01), General Instructions \n- Construction Services - Bid Security Requirements, enquiries should be received no later than  Seven (7) \nbusiness days prior to the date set for solicitation closing to allow sufficient time to  provide a response. \nEnquiries received after that time may not result in an answer being provided.  \n \n2. To ensure consistency and quality of the information provided to Bidders, the Contracting Officer will examine \nthe content of the enquiry and will decide whether or not to issue an amendment.  \n \n3. All enquiries and other communications related to this bid sent throughout the solicitation period must be \ndirected ONLY to the Contracting Officer named on the Invitation to Tender - Page 1. Failure to comply with this \nrequirement may result in the bid being declared non-compliant. \n \nSI04 NO SITE VISIT  \n \nNo site visit is required for this project. \n \nSI05 REVISION OF BID \n \n1. Article GI10 of R2710T (2022-12-01) is replaced by the following; \n \n2. A bid submitted in accordance with these instructions may be revised by letter provided the revision is received \nat the office designated for the receipt of bids on or before the date and time set for the closing of the \nsolicitation. It shall be attached to an email as a new PDF document with the following informati on clearly \nindicated: \n   \na. REVISED “BID AND ACCEPTANCE FORM” DATED __________(insert date of original bid submitted to \nDFO); \nb. Solicitation Number; \nc. Be on the Bidder's letterhead or bear a signature that identifies the Bidder;  \nd. For the lump sum portion of a bid, clearly identify the amount of the current revision. The total aggregate sum of \nall revisions submitted, including the current revision, shall be shown separately; and  \ne. For the Price Per Unit portion of a bid, clearly identify the change(s) in the Price(s) per Unit and the specific \nItem(s) to which each change applies. If a revision is to be applied to a specific Item that was previously \namended then, in addition to the amount of the current revision, the total aggregate sum of all revisions \nsubmitted, including the current revision, for that Item shall be shown separately.  \n \n3. A letter submitted to confirm an earlier revision shall be clearly identified as “CONFIRMATION ONLY” for each \ncontemplated change. \n \n4. Failure to comply with any of the above provisions shall result in the rejection of the non -compliant revision(s) \nonly. The bid shall be evaluated based on the original bid submitted and all other compliant revision(s).   \n \nSI06 OPENING OF BIDS \n \nThere will be no public opening of bids. \n \nSI07 BID RESULTS \n \nBid received will be registered on DFO “Bid Register” form and the Unofficial Bid Result will be emailed to all \nbidders that were listed on the Bid Register.  The Bid Register will provide the following information:  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 8 of 32 \n \n \na. Name of the Bidder \nb. Date and time bid was received from the Bidder \nc. Bidder bid amount \n \nSI08 Office of  the Procurement Ombudsman clauses (OPO) \n \nDispute Resolution (i.e. “mediation”) clause,  \n \nThe Parties agree to make every reasonable effort, in good faith, to settle amicably all disputes or claims relating to \nthe Contract, through negotiations between the Parties’ representatives authorized to settle. If the Parties do not \nreach a settlement within 25 working days after the dispute was initially raised to the other party in writing, either \nParty may contact the Office of the Procurement Ombudsman (OPO) to request dispute resolution/mediation \nservices. OPO may be contacted by e-mail at boa.opo@boa-opo.gc.ca, by telephone at 1-866-734-5169, or by web \nat www.opo-boa.gc.ca.  \n \nReview of Complaint clause re: contract “award”,  \n \nThe Office of the Procurement Ombudsman (OPO) was established by the Government of Canada to provide an \nimpartial, independent venue for Canadian bidders to raise complaints regarding the award of certain federal \ncontracts under $33,400 for goods and $133,800 for services. If you have concerns regarding the award of a federal \ncontract below these dollar amounts, you may contact OPO by e-mail at boa.opo@boa-opo.gc.ca, by telephone at \n1-866-734-5169, or by web at www.opo-boa.gc.ca.  \n \nReview of complaint clause re: contract “administration”, \n \nThe Office of the Procurement Ombudsman (OPO) was established by the Government of Canada to provide an \nimpartial, independent venue for Canadian bidders to raise complaints regarding the administration of certain \nfederal contracts, regardless of dollar value. If you have concerns regarding the administration of a federal contract, \nyou may contact OPO by e-mail at boa.opo@boa-opo.gc.ca, by telephone at 1-866-734-5169, or by web at \nwww.opo-boa.gc.ca.  \n \n \nSI09 INSUFFICIENT FUNDING \n \nIn the event that the lowest compliant bid exceeds the amount of funding allocated for the Work, Canada in its \nsole discretion may: \n \na. cancel the solicitation;  \nb. obtain additional funding and award the Contract to the Bidder submitting the lowest compliant bid; or  \nc. negotiate a reduction in the bid price and/or scope of work of not more than 15% with the Bidder submitting \nthe lowest compliant bid.  Should an agreement satisfactory to Canada not be reached, Canada shall \nexercise option (a) or (b). \n \nSI10 BID VALIDITY PERIOD \n \n1. Canada reserves the right to seek an extension to the bid validity period prescribed in BA04 of the Bid and \nAcceptance Form.  Upon notification in writing from Canada, Bidders will have the option to either accept or reject \nthe proposed extension. \n \n2. If the extension referred to in paragraph 1 above is accepted, in writing, by all those who submitted bids, then \nCanada will continue immediately with the evaluation of the bids and its approvals processes.   \n \n3. If the extension referred to in paragraph 1 above is not accepted in writing by all those who submitted bids then \nCanada will, at its sole discretion, either \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 9 of 32 \n \na. continue to evaluate the bids of those who have accepted the proposed extension and seek the necessary \napprovals; or \nb. cancel the invitation to tender. \n \n4. The provisions expressed herein do not in any manner limit Canada’s rights in law or under GI11 - Rejection of \nBid - of R2710T (2022-12-01). \n \nSI11 RIGHTS OF CANADA \n \n1. Canada reserves the right to: \n \na. Reject any or all bids received in response to the bid solicitation;  \nb. Enter into negotiations with bidders on any or all aspects of their bids;  \nc. Accept any bid in whole or in part without negotiations; \nd. Cancel the bid solicitation at any time; \ne. Reissue the bid solicitation; \nf. If no compliant bids are received and the requirement is not substantially modified, reissue the bid \nsolicitation by inviting only the bidders who bid to resubmit bids within a period designated by Canada; and  \ng. Negotiate with the sole compliant Bidder to ensure best value to Canada.  \n \nSI12 CONSTRUCTION DOCUMENTS \n \n  N/A \n \nSI13 INDUSTRIAL SECURITY REQUIREMENT / SECURITY CLEARANCE  \n \n There is no security requirement for this project. \n \nSI14 INTEGRITY PROVISIONS BID REQUIREMENTS  \n \n1. LIST OF NAMES FOR INTEGRITY VERIFICATION FORM (TO BE COMPLETED FOR ALL BID SUBMISSIONS ) \n \nIn accordance with the Ineligibility and Suspension Policy, section 17 requires suppliers, regardless of their status \nunder the policy provide the following information when bidding, contracting or entering into a real property \nagreement. Bidders must provide the required documentation, as applicable, to be given further consideration in the \nprocurement process: \n \nA list of names for integrity verification.  \n \nThe list required differs according to the bidder or the bidder’s organizational structure:  \n \no suppliers that are corporate entities, including those bidding as joint ventures, must provide a complete list of \nthe names of all current directors or, for a privately owned corporation, the names of the owners of the \ncorporation;  \no suppliers bidding as sole proprietors, including sole proprietors bidding as joint ventures,  must provide a \ncomplete list of the names of all owners; or \no suppliers that are a partnership do not need to provide a list of names.  \n \nIf the list of names has not been received in a procurement process or real property transaction by the time the \nevaluation of bids or offers is completed, or has not been received in a procurement process or real property \ntransaction where no bid/offer will be submitted, the contracting authority will inform the supplier of a time within \nwhich to provide the information. Providing the required names is a mandatory requirement for award of a contract \nor real property agreement. Failure to provide the list of names within the time specified will render a bid or offer \nnon-responsive, or the supplier otherwise disqualified for award of a contract or real property agreement.  \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 10 of 32 \n \nPlease refer to Information Bulletin: Required information to submit a bid or offer for additional details. To submit \nrequired information, Bidders may use the form titled Integrity Regime Verification, found in Appendix 2. \n \n2. INTEGRITY DECLARATION FORM (TO BE COMPLETED ONLY WHEN CERTAIN CONDITIONS APPLY)  \n \nThe bidder must submit with its bid an Integrity Declaration Form only when the following is applicable. If so, he \nmust sign section 2 of Appendix 2. \n \na) The supplier must submit a completed Integrity Declaration Form to disclose any information pertaining to any \ncriminal charge or conviction in the past three years of a Canadian offence listed in section 6 of the Integrity \nDeclaration Form (the “policy”) or similar foreign offence listed in section 7 of the Policy.  \n \nb) The supplier must submit a completed Integrity Declaration Form if the supplier cannot provide certification to all \nof the Integrity provisions requirements listed below.  By submitting a bid or offer in response to a bid solicitation \nor real property transaction, the supplier is certifying the following :  \n \n1. It has read and understands the Ineligibility and Suspension Policy; \n \n2. It understands that certain domestic and foreign criminal charges and convictions, and other circumstances, \nas described in the Policy, will or may result in a determination of ineligibility or suspension under the \nPolicy; \n \n3. It is aware that Canada may request additional information, certifications, and validations from the [Offeror] \nor a third party for purposes of making a determination of ineligibility or suspension;  \n \n4. It has provided with its [bid/offer] a complete list of all foreign criminal charges and convictions pertaining to \nitself, its affiliates and its proposed first-tier subcontractors that, to the best of its knowledge and belief, may \nbe similar to one of the listed offences in the Policy; \n \n5. None of the domestic criminal offences, and other circumstances, described in the Policy that will or may \nresult in a determination of ineligibility or suspension, apply to it, its affiliates and its proposed first -tier \nsubcontractors; and \n \n6. It is not aware of a determination of ineligibility or suspension issued by PSPC that applies to it.  \n \nThe completed Integrity Declaration Form must be submitted with its bid/offer.  The completed form must be placed \nin a sealed envelope labeled “Protected B”, and addressed to: \n \nIntegrity Regime \nDepartmental Oversight Branch \nPublic Works and Government Services Canada \nL'Esplanade Laurier, West Tower \n300 Laurier Avenue West \nFloor 10, Room 10149 \nOttawa, ON  K1A 0R5 \nCanada \n \nSI15 LISTING OF SUBCONTRACTORS \n  \nR2710T, GI07 has been amended to the following.  \n \nGI07 (2015-02-25) Listing of Subcontractors  \n \nThe Bidder must submit the names of Subcontractors for the part or parts of the Work listed. See Appendix 3. \nFailure to do so will result in the disqualification of its bid. \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 11 of 32 \n \nSI16 PROCUREMENT STRATEGY FOR INDIGENOUS BUSINESS  \n \nN/A \n \nSI17 WEB SITES \n \nThe connection to some of the Web sites in the solicitation documents is established by the use of hyperlinks. The \nfollowing is a list of the addresses of the Web sites: \n \nCanadaBuys \nHomepage | CanadaBuys \n \nCanadian economic sanctions \nhttps://www.international.gc.ca/world-monde/international_relations-\nrelations_internationales/sanctions/index.aspx?lang=eng \n \nStandard Acquisition Clauses and Conditions (SACC Manual)  \nhttps://buyandsell.gc.ca/policy-and-guidelines/standard-acquisition-clauses-and-conditions-manual/all  \n \nPWGSC, Security requirements for contracting with the Government of Canada  \nhttps://www.tpsgc-pwgsc.gc.ca/esc-src/index-eng.html  \n \nPWGSC, Code of Conduct for Procurement \nhttps://www.tpsgc-pwgsc.gc.ca/app-acq/cndt-cndct/cca-ccp-eng.html \n \nIntegrity Verification Form: \nhttps://www.canada.ca/en/public-services-procurement/services/standards-oversight/supplier-integrity-\ncompliance/forms.html  \n \nIntegrity Declaration Form \nhttps://www.canada.ca/en/public-services-procurement/services/standards-oversight/supplier-integrity-\ncompliance/forms.html \n \nTrade agreements \nTrade agreements | CanadaBuys  \n \nSurety Association of Canada \nhttps://www.suretycanada.com/ \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 12 of 32 \n \nCONTRACT DOCUMENTS (CD)  \n \n1. The following are the Contract Documents: \n \na. Acceptance By Fisheries and Oceans Canada (Contract) when signed by Canada;  \nb. Duly completed Bid and Acceptance Form and any Appendices attached thereto;  \nc. Drawings and Specifications; \nd. General Conditions and clauses: \n \nGC1 - General provisions – Construction services  R2810D (2022-12-01); \nGC2 - Administration of the Contract - Construction Services  R2820D (2016-01-28); \nGC3 - Execution and control of the work  R2830D (2019-11-28); \nGC4 - Protective Measures  R2840D (2008-05-12); \nGC5 - Terms of Payment >100K - Construction Services  R2850D (2019-11-28); \nGC6 - Delays and Changes in the Work – Construction Services  R2865D (2019-05-30); \nGC7 - Default, Suspension or Termination of Contract  R2870D (2018-06-21); \nGC8 - Dispute Resolution - 100K to 5M - Construction Services  R2880D (2019-11-28); \nGC8 - Dispute Resolution - >5M – Construction Services  R2882D (2019-11-28); \nGC8 - Dispute Resolution - <100K – Construction Services  R2884D (2016-01-28); \nGC9 - Contract Security  R2890D (2022-12-01); \nGC10 - Insurance  R2900D (2008-05-12); \nGC6.4.1 - Allowable Costs for Contract Changes Under General \nCondition   \nR2950D (2015-02-25); \n \ne. Supplementary Conditions; \nf. Any amendment issued or any allowable bid revision received before the date and time set for solicitation \nclosing; \ng. Any amendment incorporated by mutual agreement between Canada and the Contractor before acceptance \nof the bid; and \nh. Any amendment or variation of the contract documents that is made in accordance with the General \nConditions. \n \n2. The documents identified by title, number and date above are incorporated by reference and are set out in the \nStandard Acquisition Clauses and Conditions (SACC) Manual, issued by Public Works and Government \nServices Canada (PWGSC). The SACC Manual is available on the PWGSC Web site: \nhttps://buyandsell.gc.ca/policy-and-guidelines/standard-acquisition-clauses-and-conditions-manual. \n \nAll references to the Department of Public Works & Government Services Canada (PWGSC) in the instructions, \ngeneral terms, conditions and clauses identified in the Invitation to Tender (ITT) by number, date and title, are \nset out in the Standard Acquisition Clauses and Conditions Manual (https://buyandsell.gc.ca/policy-and-\nguidelines/standard-acquisition-clauses-and-conditions-manual) are to be replaced with Fisheries and Oceans \nCanada (DFO).   \n \n3. The language of the contract documents is the language of the Bid and Acceptance Form submitted.  \n \nSUPPLEMENTARY CONDITIONS (SC) \n \nSC01 INDUSTRIALSECURITY RELATED REQUIREMENTS, DOCUMENT SAFEGUARDING  \n \nThere is no document security requirement applicable to this Contract. \n \nSC02 INSURANCE TERMS \n \n \n1. Insurance Contracts \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 13 of 32 \n \na. The Contractor must, at the Contractor's expense, obtain and maintain insurance contracts in accordance \nwith the requirements of the Certificate of Insurance. Coverage must be placed with an Insurer licensed to \ncarry out business in Canada. \n \nb. Compliance with the insurance requirements does not release the Contractor from or reduce its liability \nunder the Contract. The Contractor is responsible for deciding if additional insurance coverage is necessary \nto fulfill its obligation under the Contract and to ensure compliance with any applicable law. Any additional \ninsurance coverage is at the Contractor's expense, and for its own benefit and protection.  \n \n2. Period of Insurance \n \na. The policies required in the Certificate of Insurance must be in force from the date of contract award and be \nmaintained throughout the duration of the Contract. \n \nb. The Contractor must be responsible to provide and maintain coverage for Products/Completed Operations \nhazards on its Commercial General Liability insurance policy, for a period of six (6) years beyond the date \nof the Certificate of Substantial Performance. \n \n3. Proof of Insurance \n \na. Before commencement of the Work, and no later than thirty (30) days after acceptance of its bid, the \nContractor must deposit with Canada a Certificate of Insurance on the form attached herein titled  \nCertificate of Insurance, Annex B. \n \nb. Upon request by Canada, the Contractor must provide originals or certified true copies of all contracts of \ninsurance maintained by the Contractor pursuant to the Certificate of Insurance.  \n \n4. Insurance Proceeds \n \nIn the event of a claim, the Contractor must, without delay, take measures and sign the documents that are \nnecessary to effect payment of the amount that is due. \n \n5. Deductible \n \nThe payment of monies up to the deductible amount made in satisfaction of a claim must be borne by the \nContractor. \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 14 of 32 \n \nBID AND ACCEPTANCE FORM (BA)  \n \nBA01 IDENTIFICATION \n \nDevelopment of  Service Area in Kegaska Harbour,  Lower North Shore, Quebec  \n \nBA02 BUSINESS NAME AND ADDRESS OF BIDDER \n \n Legal Name:  _________________________________________________________________________  \n \n Operating Name (if any): __________________________________________________________________  \n \nAddress:  _________________________________________________________________________  \n \n   _________________________________________________________________________  \n \n Telephone:  _________________ Fax: ____________________ PBN:_________________________  \n \nEmail address: __________________________________________________________________________  \n \nIndustrial Security Program Organisation Number (ISP ORG#): ____________________________________  \n          (when required) \nOrganizational Structure:  \n \n ___ Corporate Entity    ___   Privately Owned Corporation    ___ Sole Proprietor      ___ Joint Venture   \n  \nBA03 THE OFFER \n  \nThe Bidder offers to Canada to perform and complete the Work for the above named project in accordance with \nthe Bid Documents for the TOTAL BID AMOUNT INDICATED IN APPENDIX 1. \n \nBA04 BID VALIDITY PERIOD \n \nThe bid must not be withdrawn for a period of thirty (30) days following the date of solicitation closing.  \n \nBA05 ACCEPTANCE AND CONTRACT \n \nUpon acceptance of the Bidder’s offer by Canada, a binding Contract will be formed between Canada and the \nBidder. The documents forming the Contract will be the Contract Documents identified in “Contract Documents \n(CD)” section. \n \nBA06 CONSTRUCTION TIME \n \nThe Contractor must perform and complete all Work by December 12, 2025. See specifications for the project \nmilestones. \n \nBA07 BID SECURITY \n \nThe Bidder must enclose bid security with its bid in accordance with GI08 - Bid Security Requirements of \nR2710T (2022-12-01), General Instructions – Construction Services – Bid Security Requirements. \n \nBA08 ELECTRONIC PAYMENT OF INVOICES \n \nAlthough electronic payment is the preferred method of payment, the Bidder is not obligated to accept payment by \nElectronic Payment Instruments. \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 15 of 32 \n \nThe Contractor accepts to be paid using any of the following Electronic Payment Instrument(s):  \na) Acquisition Card; or \nb) Direct Deposit (Domestic and International); \n \nIf you are the successful bidder on this or any other DFO requirement, you are encouraged to register with DFO for \ndirect deposit.  Contact DFO Corporate Accounting by e-mail: DFO.invoicing-facturation.MPO@canada.ca to \nreceive a form titled Recipient Electronic Payment Registration Request along with instructions for completion of the \nform.   \n \nInvoices submitted shall be paid in accordance with the General Conditions and clause GC5, Terms of \nPayment.  \n \nBA09  SIGNATURE \n \n \n________________________________________________________________  \nName and title of person authorized to sign on behalf of Bidder (type or print) \n \n \n_______________________________               ______________________________ \nSignature      Date \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 16 of 32 \n \nAPPENDIX 1 - COMBINED PRICE FORM \n \n1. The prices per unit willl govern in establishing the Total Extended Amount. Any arithmetical errors in this Appendix \nwill be corrected by Canada. \n \n2. Canada may reject the bid if any of the prices submitted do not reasonably reflect the cost of performing the part of \nthe work to which that price applies. \n \n \nLUMP SUM \n \nThe Lump Sum Amount designates Work to which a Lump Sum Arrangement applies.  \n \n(a) Work included in the Lump Sum Amount represents all work not included in the unit price table. \n \nItem Class of Labour, Plant or Material Unit of \n  Measurement \nEstimated \nQuantity            \n(EQ) \nExtended amount  \napplicable \ntax(es) extra \n   1 Mobilization - demobilization Lump sum  1 $ \n2 Site organization Lump sum  \n1 $ \n3 Demolition, excavation and recovery Lump sum  \n1 $ \n4 Crane Lump sum  \n1 $ \n5 Installation of DFO Provided components Lump sum  \n1 $ \n6 Construction of shed for electrical power supply Lump sum  \n1 $ \n7 Civil Works related to electrical Lump sum  \n1 $ \n8 Service post and protection plates Lump sum  \n1 $ \n9 Electrical work Lump sum  \n1 $ \n10 Concrete Lump sum  \n1 $ \n11 Pavement Lump sum  \n1 $ \n12 Various pipes Lump sum  \n1 $ \n13 Geotextile fabric Lump sum  \n1 $ \nTOTAL LUMP SUM AMOUNT  (LSA) \nExcluding applicable taxes    \n$ \n \nAND \n \nUNIT PRICE TABLE \n \nThe Unit Price Table designates Work to which a Unit Price Arrangement applies.  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 17 of 32 \n \n \n(a) Work included in each item is as described in the referenced specification section.  \n(b) The Price per Unit shall not include any amounts for Work that is not included in that unit price Item.  \n \nItem \n Class of Labour, Plant or Material \nUnit of \nMeasur-\nement \nEstimated \nQuantity            \n(EQ) \nPrice per \nUnit \napplicable \ntaxes extra             \n(PU) \nExtended amount \n(EQ x  PU) \nApplicable taxes \nextra \n1 Backfiling of operation area \n \nTon 1500 $ $ \n2 Quarry run 0-300 mm \n \nTon 350 $ $ \n3 Stones 300-600mm \n \nTon 100 $ $ \n4 Mg 56 \n \nTon 850 $ $ \n5 Mg 20 \n \nTon 75 $ $ \nTOTAL UNIT PRICE BID AMOUNT   \nExcluding applicable taxes $ \n \n \nFor evaluation purposes, the bidder must complete the table below using the pricing information provided above.  \n \nDescription Extended amount \nApplicable taxes extra \n TOTAL LUMP SUM AMOUNT (LSA)  \nEXCLUDING APPLICABLE TAXES  $ \nMANDATORY WORK - TOTAL UNIT PRICE BID AMOUNT  \nEXCLUDING APPLICABLE TAXES  $ \nTOTAL BID AMOUNT (FOR EVALUATION PURPOSES)  $ \n \n \n \n \n \n \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 18 of 32 \n \n \nAPPENDIX 2 – INTEGRITY REGIME VERIFICATION \n \n1. LIST OF NAMES FOR INTEGRITY VERIFICATION FORM \n \nRequirements \n \nSection 17 of the Ineligibility and Suspension Policy requires suppliers, regardless of their status under the policy, to \nsubmit a list of names with their bid or offer. The list differs depending on the bidder or offeror’s organizational \nstructure: \n \n• Suppliers including those bidding as joint ventures, whether incorporated or not, must provide a complete \nlist of the names of all current directors \n• Privately owned corporations must provide a list of the owners’ names \n• Suppliers bidding as sole proprietors, including sole proprietors bidding as joint ventures, whether \nincorporated or not, must provide a complete list of the names of all owners  \n• Suppliers that are a partnership do not need to provide a list of names  \n \nSuppliers may use this form to provide the list of names with their bid or offer submission. Failure to submit this \ninformation with a bid or offer, where required, will render a bid or offer non -responsive, or the supplier otherwise \ndisqualified for award of a contract or real property agreement. Please refer to Information Bulletin: information to \nsubmit a bid or offer for additional details. \n \nSupplier information \n \nSupplier’s legal name: \nOrganizational structure: \n \n☐ Corporate entity \n☐ Privately owned corporation \n☐ Sole proprietor \nSupplier’s address: \nSupplier’s procurement business number (optional): \nSolicitation or transaction number: \n  \n \nDate of bid, offer submission or closing date of Invitation to Offer (yyyy-mm- dd): \n \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 19 of 32 \n \n \nList of names \n \nName Title \n  \n  \n  \n  \n  \n  \n  \n \nDeclaration \n \nI, (name)  , (position) , of (supplier’s name) declare that \nthe information provided in this Form is, to the \nbest of my knowledge and belief, true, accurate and complete. I am aware that failing to provide the list of names \nwill render a bid or offer non-responsive, or I will be otherwise disqualified for award of a contract or real property \nagreement. I am aware that during the bid or offer evaluation stage, I must, within 10 w orking days, inform the \ncontracting authority in writing of any changes affecting the list of names submitted. I am also aware that after \ncontract award I must inform the Registrar of Ineligibility and Suspension  within 10 working days of any changes \nto the list of names submitted. \n \n \nSignature \nPlease include with your bid or offer. \n \n \n \n2. INTEGRITY DECLARATION FORM (TO BE COMPLETED ONLY WHEN CERTAIN CONDITIONS APPLY, SEE \nSI14 POINT 2) \n \nIf bidder submitted an Integrity Declaration Form with the bid as detailed in section SI14 please complete the \nfollowing:  \n \nIntegrity Declaration Form was submitted with bid _______________________________________.  \n(provide detail, such as email date, etc.)    \n \n \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 20 of 32 \n \nAPPENDIX 3 – LISTING OF SUBCONTRACTORS \n \n1. In accordance with section GI07 - Listing of Subcontractors and Suppliers of R2710T (2022-12-01)  - General \nInstructions -Construction Services – Bid Security Requirements the Bidder must provide a list of Subcontractors \nwith their Bid. \n \nThe Bidder should submit the list of Subcontractors and for any portion of the Work valued at 20% or greater of the \nsubmitted Bid Price.  \n \n Subcontractor Estimated \nValue of work \n1   \n2   \n3   \n4   \n5   \n6   \n7   \n8   \n9   \n10   \n \n \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 21 of 32 \n \nANNEX A – STATEMENT OF WORK  \n \n \nTitle: \n Development of  Service Area in Kegaska Harbour,  Lower North Shore, Quebec  \n    \nStatement of Work  \n \nWork is located in Kegaska Harbour in Lower North Shore and include in summary, but not limited to :  \n \nExcavation and disposal of top soil.  \nLeveling of existing parking \n \nBackfilling of new parking area. \n \nPavement of part of operation area; \nRelocation of existing crane \n \nElectrical work; \n \n• New electrical hookup \n• New shed; \n• Service post power supply; \n• Pipes and pulling boxes for further works; \n• Lighting \n \nFamiliarization with Site: \n \nBefore submitting a bid, bidders can visit the site and its surroundings, at their own expense, to review and verify the form, \nnature, and extent of the work, materials needed for the completion of the work, the means of access to the site, severity, \nexposure, and uncertainty of weather, soil conditions, any accommodations they may require, and in general shall obtain all \nnecessary information as to risks, contingencies, and other circumstances which may influence or affect their bid. No \nallowance shall be made subsequently in this connection on account or error or negligence to properly obse rve and \ndetermine the conditions that will apply. \n \nTake all appropriate safety measures for any visit to site, either before or after acceptance of bid.  \n \nAll work under this contract must be completed no later than December 12, 2025 \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 22 of 32 \n \n \nANNEX B - CERTIFICATE OF INSURANCE  \n(Not required when submitting a bid) \n \nCERTIFICATE OF INSURANCE \nPage 1 of 2 \nDescription and Location of Work  Contract No.  \n \n \n \nProject No. \n \nName of Insurer, Broker or Agent  Address (No., Street)                   City                    Province        Postal Code  \n  \n \nName of Insured (Contractor)     Address (No., Street)              City                   Province        Postal Code  \n \n \nAdditional Insured \n \nHis Majesty the King in Right of Canada as represented by Fisheries and Ocean (DFO) \n \nType of Insurance \n(Required when Checked) \nInsurer Name  \nand Policy \nNumber \nInception \nDate \nD / M / Y \nExpiry \nDate \nD / M / Y \nLimits of Liability \n \n \n \n Commercial General  \n               Liability   \n      \n Umbrella/Excess Liability \n   Per  \nOccurrence \n \n$ \n \n$ \nAnnual \nGeneral \nAggregate \n \n$ \n \n$ \nCompleted \nOperations \nAggregate \n \n$ \n \n$ \n \n Builder’s Risk / Installation \n              Floater \n \n \n \n  $ \n \n \n Contractors Pollution  \n               Liability \n \n \n  $ \nPer Incident   \nPer occurrence \nAggregate \n \n$ \nMarine Liability  \n \n  $ \n \n \n Aviation Liability    $ \nPer Incident   \nPer occurrence \nAggregate \n \n$ \nInsert other type of \ninsurance as required \n    \n$ \n \n \nI certify that the above policies were issued by insurers in the course of their Insurance business in Canada, are currently in \nforce and include the applicable insurance coverages stated on page 2 of this Certificate of Insurance, including advance \nnotice of cancellation / reduction in coverage. \n \n \n                                                 \nName of person authorized to sign on behalf of Insurer(s)   Telephone Number \n(Officer, Agent, Broker)        \n \n \n________________________________________________________                              \nSignature                                                                                                                           Date  D / M / Y \n \nCERTIFICATE OF INSURANCE \n \n \n \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 23 of 32 \n \nPage 2 of 2 \nGeneral \n \n1. The insurance policies required on \npage 1 of the Certificate of Insurance \nmust be in force and must include the \ninsurance coverages listed under the \ncorresponding type of insurance on \nthis page. \n \n1. The policies must insure the \nContractor and must include His \nMajesty the king in Right of Canada as \nrepresented by the Fisheries and \nOceans Canada (DFO) as an \nadditional insured.  \n \n2. The  Policy shall be endorsed to \nprovide the Owner  with not less than \nthirty (30) days notice in writing in \nadvance of a cancellation or change or \namendment restricting coverage. \n \nWithout increasing the limit of liability, \nthe policies must protect all insured \nparties to the full extent of coverage \nprovided. Further, the policies must \napply to each Insured in the same \nmanner and to the same extent as if a \nseparate policy had been issued to \neach. \nCommercial General Liability \n \nThe insurance coverage provided must not be \nsubstantially less than that provided by the \nlatest edition of IBC Form 2100.  \n \nThe policy must either include or be endorsed \nto include coverage for the following \nexposures or hazards if the Work is subject \nthereto: \n(a) Blasting. \n(b) Pile driving and caisson work. \n(c) Underpinning.    \n(d) Removal or weakening of support of any \nstructure or land whether such support \nbe natural or otherwise if the work is \nperformed by the insured contractor. \n \n The policy must have the following minimum \nlimits: \n \n(a) $5,000,000 Each Occurrence Limit;  \n \n(b) $10,000,000 General Aggregate Limit \nper policy year if the policy contains a \nGeneral Aggregate; and \n \n(c) $5,000,000 Products/Completed \nOperations Aggregate Limit. \n \nUmbrella or excess liability insurance may be \nused to achieve the required limits. \n \nBuilder's Risk / Installation Floater \n \nThe insurance coverage provided must \nnot be less than that provided by the \nlatest edition of IBC Forms 4042 and \n4047. \n \nThe policy must permit use and \noccupancy of any of the projects, or any \npart thereof, where such use and \noccupancy is for the purposes for which \na project is intended upon completion. \n \nThe policy may exclude or be endorsed \nto exclude coverage for loss or damage \ncaused by asbestos, fungi or spores, \ncyber and terrorism. \n \nThe policy must have a limit that is not \nless than the sum of the contract \nvalue plus the declared value (if any) set \nforth in the contract documents of all \nmaterial and equipment supplied by \nCanada at the site of the project to be \nincorporated into and form part of the \nfinished Work.  If the value of the Work is \nchanged, the policy must be changed to \nreflect the revised contract value. \n \nThe policy must provide that the \nproceeds thereof are payable to Canada \nor as Canada may direct in accordance \nwith GC10.2, \"Insurance Proceeds\" \n(https://buyandsell.gc.ca/policy-and-\nguidelines/standard-acquisition-clauses-\nand-conditions-manual/5/R/R2900D/2). \nContractors Pollution Liability \n \nThe policy must have a limit usual for \na contract of this nature, but not less \nthan $1,000,000 per incident or \noccurrence and in the aggregate.  \n \nMarine Liability \n \nThe insurance coverage must be provided by \na Protection & Indemnity (P&I) insurance \npolicy and must include excess collision \nliability and pollution liability.  \n \nThe insurance must be placed with a member \nof the International Group of Protection & \nIndemnity Associations or with a fixed market \nin an amount of not less than the limits \ndetermined by the Marine Liability Act, S.C. \n2001, c. 6. Coverage must include crew \nliability, if it is not covered by the statutory \nrequirements of the Territory or Province \nhaving jurisdiction over such employees.  \n \nThe policy must waive all rights of subrogation \nagainst the Government of Canada for any \nand all loss of or damage to the watercraft \nhowever caused. \nAviation Liability \n \nThe insurance coverage shall Include \nBodily Injury (including passenger Bodily \nInjury) and Property Damage, in an \namount of not less than $5,000,000 per \nincident or occurrence and in the \naggregate. \n \n  \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 24 of 32 \n \n \nANNEX C – SPECIFICATIONS \n \nRefer to CanadaBuys Attachment titled: “Annex C 1 F3731 250015_Kegaska_civ spec Eng AND Annex C 2 F3731-\n250015_Elec_spec Eng ” \n \n \n \n \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 25 of 32 \n \nANNEX D – DRAWINGS, PLANS, PHOTOS, OTHER \n \n \nRefer to CanadaBuys Attachment titled: “Annex D 1 PPB24-4068-civil drawing Eng-FR AND Annex D 2 PPB24-4068-E00-\nelectrical drawing Eng-FR” \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 26 of 32 \n \n \nANNEX E - GENERAL INSTRUCTIONS - CONSTRUCTION SERVICES - BID SECURITY REQUIREMENTS - R2710T \n(2022-12-01)   \n \nThe following GI’s are included by reference  \n \nGI01 (2016-04-04) Integrity provisions—bid \n \n1.  The Ineligibility and Suspension Policy (the “Policy”) in effect on the date the bid solicitation is issued, and all \nrelated Directives in effect on that date, are incorporated by reference into, and form a binding part of the bid \nsolicitation. The Bidder must comply with the Policy and Directives, which can be found at Ineligibility and \nSuspension Policy.  \n2. Under the Policy, charges and convictions of certain offences against a Bidder, its affiliates or first tier \nsubcontractors, and other circumstances, will or may result in a determination by Public Works and Government \nServices Canada (PWGSC) that the Bidder is ineligible to enter, or is suspended from entering into a contract \nwith Canada. The list of ineligible and suspended Suppliers is contained in PWGSC’s Integrity Database. The \nPolicy describes how enquiries can be made regarding the ineligibility or s uspension of Suppliers. \n3. In addition to all other information required in the bid solicitation, the Bidder must provide the following:  \na. by the time stated in the Policy, all information required by the Policy described under the heading \n“Information to be Provided when Bidding, Contracting or Entering into a Real Property Agreement”; \nand \nb. with its bid, a complete list of all foreign criminal charges and convictions pertaining to itself, its affiliates \nand its proposed first tier subcontractors that, to the best of its knowledge and belief, may be similar to \none of the listed offences in the Policy. The list of foreign criminal charges and convictions must be \nsubmitted using an Integrity Declaration Form, which can be found at Declaration form for procurement.  \n4. Subject to subsection 5, by submitting a bid in response to this bid solicitation, the Bidder certifies that:  \na. it has read and understands the Ineligibility and Suspension Policy; \nb. it understands that certain domestic and foreign criminal charges and convictions, and other \ncircumstances, as described in the Policy, will or may result in a determination of ineligibility or \nsuspension under the Policy; \nc. it is aware that Canada may request additional information, certifications, and validations from the \nBidder or a third party for purposes of making a determination of ineligibility or suspension;  \nd. it has provided with its bid a complete list of all foreign criminal charges and convictions pertaining to \nitself, its affiliates and its proposed first tier subcontractors that, to the best of its knowledge and belief, \nmay be similar to one of the listed offences in the Policy; \ne. none of the domestic criminal offences, and other circumstances, described in the Policy that will or \nmay result in a determination of ineligibility or suspension, apply to it, its affiliates and its proposed first \ntier subcontractors; and \nf. it is not aware of a determination of ineligibility or suspension issued by PWGSC that applies to it.  \n5. Where a Bidder is unable to provide any of the certifications required by subsection 4, it must submit with its bid \na completed Integrity Declaration Form, which can be found at Declaration form for procurement.  \n6. Canada will declare non-responsive any bid in respect of which the information requested is incomplete or \ninaccurate, or in respect of which the information contained in a certification or declaration is found by Canada \nto be false or misleading in any respect. If Canada establishes after award of the Contract that the Bidder \nprovided a false or misleading certification or declaration, Canada may terminate the Contract for default. \nPursuant to the Policy, Canada may also determine the Bidder to be ineligibl e for award of a contract for \nproviding a false or misleading certification or declaration.  \n \nGI02 (2014-03-01) Completion of bid  \n \n1. The bid shall be  \na. submitted on the Bid and Acceptance Form provided through the Government Electronic Tendering \nService (GETS) or on a clear and legible reproduced copy of such Bid and Acceptance Form that must \nbe identical in content and format to the Bid and Acceptance Form provided through GETS; \nb. based on the Bid Documents listed in the Special Instructions to Bidders;  \nc. correctly completed in all respects; \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 27 of 32 \n \nd. signed by a duly authorized representative of the Bidder; and \ne. accompanied by  \ni. bid security as specified in GI08; and \nii. any other document or documents specified elsewhere in the solicitation where it is stipulated \nthat said documents are to accompany the bid. \n2. Subject to paragraph 6) of GI11, any alteration to the pre-printed or pre-typed sections of the Bid and \nAcceptance Form, or any condition or qualification placed upon the bid may be cause for disqualification. \nAlterations, corrections, changes or erasures made to statements or figures entered on the Bid and Acceptance \nForm by the Bidder shall be initialed by the person or persons signing the bid. Alterations, corrections, changes \nor erasures that are not initialed shall be deemed void and without effect.  \n3. Unless otherwise noted elsewhere in the Bid Documents, facsimile copies of bids are not acceptable.  \n4. Canada will make available Notices of Proposed Procurement (NPP), bid solicitations and related documents \nfor download through the Government Electronic Tendering Service (GETS). Canada is not responsible and will \nnot assume any liabilities whatsoever for the information found on websites of third parties. In the event an \nNPP, bid solicitation or related documentation would be amended, Canada will not be sending notifications. \nCanada will post all amendments, including significant enquiries received and the ir replies, using GETS. It is the \nsole responsibility of the Bidder to regularly consult GETS for the most up -to-date information. Canada will not \nbe liable for any oversight on the Bidder's part nor for notification services offered by a third party.  \n \nGI03 (2015-02-25) Identity or legal capacity of the Bidder  \n \nIn order to confirm the authority of the person or persons signing the bid or to establish the legal capacity under which \nthe Bidder proposes to enter into Contract, any Bidder who carries on business in other than its own personal name \nshall, if requested by Canada, provide satisfactory proof of \na. such signing authority; and \nb. the legal capacity under which it carries on business; \nprior to contract award. Proof of signing authority may be in the form of a certified copy of a resolution naming the \nsignatory(ies) that is (are) authorized to sign this bid on behalf of the corporation or partnership. Proof of legal capacity  \nmay be in the form of a copy of the articles of incorporation or the registration of the business name of a sole proprietor \nor partnership. \n \nGI04 (2015-02-25) Applicable Taxes \n \n“Applicable Taxes” means the Goods and Services Tax (GST), the Harmonized Sales Tax (HST), and any provincial \ntax, by law, payable by Canada such as, the Quebec Sales Tax (QST) as of April 1, 2013.  \n \nGI05 (2017-04-27) Capital development and redevelopment charges  \n \nFor the purposes of GC1.8, of R2810D \"Laws, Permits and Taxes\", in the General Conditions of the Contract, only fees \nor charges directly related to the processing and issuing of building permits shall be included. The Bidder shall not \ninclude any monies in the bid amount for special municipal development, redevelopment or other fees or charges which \na municipal authority may seek as a prerequisite to the issuance of building permi ts. \n \nGI06 (2021-04-01) Registry and pre-qualification of floating plant \n \nDredges or other floating plant to be used in the performance of the Work must be on:  \na. Canadian registry; or \nb. European Union member state or United Kingdom registry and have been granted a temporary license under \nthe Coasting Trade Act. \nFor dredges or other floating plant that are not of Canadian, European Union member state, or United Kingdom make or \nmanufacture, the Bidder must obtain a certificate of qualification from Industry Canada as described in the Floating \nPlant Appendix of the Bid and Acceptance Form, and this certificate must accompany the bid. Plant so qualified by \nIndustry Canada may be accepted on this project. \nGI07 (2015-02-25) Listing of Subcontractors and Suppliers \nNotwithstanding any list of Subcontractors that the Bidder may be required to submit as part of the bid, the Bidder shall, \nwithin 48 hours of receipt of a notice to do so, submit all information requested in the said notice including the names of \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 28 of 32 \n \nSubcontractors and Suppliers for the part or parts of the Work listed. Failure to do so shall result in the disqualification of \nits bid. \n \nGI08 (2022-12-01) Bid security requirements \n \n1. The Bidder shall submit bid security with the bid in the form of a bid bond or a security deposit in an amount that \nis equal to not less than 10 percent of the bid amount. Applicable Taxes shall not be included when calculating \nthe amount of any bid security that may be required. The maximum amount of bid security required with any bid \nis $2,000,000. \n2. A bid bond (form PWGSC-TPSGC 504) shall be in an approved form, properly completed, with original \nsignatures and sealed by the approved bonding company whose bonds are acceptable to Canada either at the \ntime of solicitation closing or as identified in Treasury Board Appendix L, Acceptable Bonding Companies. \n3. A security deposit shall be an original, properly completed, signed where required and be either  \na. a bill of exchange, bank draft or money order made payable to the Receiver General for Canada and \ncertified by an approved financial institution or drawn by an approved financial institution on itself; or  \nb. bonds of, or unconditionally guaranteed as to principal and interest by, the Government of Canada.  \n4. For the purposes of subparagraph 3. a. of GI08  \na. a bill of exchange is an unconditional order in writing signed by the Bidder and addressed to an \napproved financial institution, requiring the said institution to pay, on demand, at a fixed or determinable \nfuture time a sum certain of money to, or to the order of, the Receiver General for Canada; \nb. if a bill of exchange, bank draft or money order is certified by or drawn on an institution or corporation \nother than a chartered bank, it must be accompanied by proof that the said institution or corporation \nmeets at least one of the criteria described in subparagraph 4.c. of GI08, either by letter or by a \nstamped certification on the bill of exchange, bank draft or money; and  \nc. An approved financial institution is  \ni. a corporation or institution that is a member of the Canadian Payments Association (Payments \nCanada) as defined in the Canadian Payments Act; \nii. a corporation that accepts deposits that are insured, to the maximum permitted by law, by the \nCanada Deposit Insurance Corporation or the \"Autorité des marchés financiers\";  \niii. a corporation that accepts deposits from the public if repayment of the deposit is guaranteed by \nHis Majesty the King in right of a province; \niv. a corporation, association or federation incorporated or organized as a credit union or co -\noperative credit society that conforms to the requirements of a credit union which are more \nparticularly described in paragraph 137(6) of the Income Tax Act; or \nv. Canada Post Corporation. \n5. Bonds referred to in subparagraph 3. b. of GI08 shall be provided on the basis of their market value current at \nthe date of solicitation closing, and shall be  \na. payable to bearer;  \nb. accompanied by a duly executed instrument of transfer of the bonds to the Receiver General for \nCanada in the form prescribed by the Domestic Bonds of Canada Regulations; or  \nc. registered as to principal or as to principal and interest in the name of the Receiver General for Canada \npursuant to the Domestic Bonds of Canada Regulations.  \n6. As an alternative to a security deposit an irrevocable standby letter of credit is acceptable to Canada and the \namount shall be determined in the same manner as a security deposit referred to above.  \n7. An irrevocable standby letter of credit referred to in paragraph 6) of GI08 shall  \na. be an arrangement, however named or described, whereby a financial institution (the \"Issuer\") acting at \nthe request and on the instructions of a customer (the \"Applicant\") or on its own behalf,  \ni. is to make a payment to, or to the order of, the Receiver General for Canada as the beneficiary;  \nii. is to accept and pay bills of exchange drawn by the Receiver General for Canada;  \niii. authorizes another financial institution to effect such payment or accept and pay such bills of \nexchange; or \niv. authorizes another financial institution to negotiate against written demand(s) for payment \nprovided that the terms and conditions of the letter of credit are complied with;  \nb. state the face amount which may be drawn against it; \nc. state its expiry date; \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 29 of 32 \n \nd. provide for sight payment to the Receiver General for Canada by way of the financial institution's draft \nagainst presentation of a written demand for payment signed by the Departmental Representative \nidentified in the letter of credit by his/her office; \ne. provide that more than one written demand for payment may be presented subject to the sum of those \ndemands not exceeding the face value of the letter of credit; \nf. provide that it is subject to the International Chamber of Commerce (ICC) Uniform Customs and \nPractice (UCP) for Documentary Credits, 2007 Revision, ICC Publication No. 600, Pursuant to the \nICCUCP, a credit is irrevocable even if there is no indication to that effect; and  \ng. be issued or confirmed, in either official language, by a financial institution which is a member of the \nCanadian Payments Association (Payments Canada) and is on the letterhead of the Issuer or \nConfirmer. The format is left to the discretion of the Issuer or Confirmer. \n8. Bid security shall lapse or be returned as soon as practical following  \na. the solicitation closing date, for those Bidders submitting non-compliant bids; and \nb. the administrative bid review, for those Bidders submitting compliant bids ranked fourth to last on the \nschedule of bids; and \nc. the award of contract, for those Bidders submitting the second and third ranked bids; and  \nd. the receipt of contract security, for the successful Bidder; or  \ne. the cancellation of the solicitation, for all Bidders. \n9. Notwithstanding the provisions of paragraph 8 of GI08 and provided more than three compliant bids have been \nreceived, if one or more of the bids ranked third to first is withdrawn or rejected for whatever reason then \nCanada reserves the right to hold the security of the next highest ranked compliant bid in order to retain the bid \nsecurity of at least three valid and compliant bids. \n \nGI09 (2014-03-01) Submission of bid \n \n1. The Bid and Acceptance Form, duly completed, and the bid security shall be enclosed and sealed in an \nenvelope provided by the Bidder, and shall be addressed and submitted to the office designated on the Front \nPage \"Invitation to Tender\" for the receipt of bids. The bid must be received on or before the date and time set \nfor solicitation closing. \n2. Unless otherwise specified in the Special Instructions to Bidders  \na. the bid shall be in Canadian currency; \nb. the requirement does not offer exchange rate fluctuation risk mitigation. Requests for exchange rate \nfluctuation risk mitigation will not be considered. All bids including such provision will render the bid \nnon-responsive. \n3. Prior to submitting the bid, the Bidder shall ensure that the following information is clearly printed or typed on \nthe face of the bid envelope:  \na. Solicitation Number; \nb. Name of Bidder; \nc. Return address; and \nd. Closing Date and Time. \n4. Timely and correct delivery of bids is the sole responsibility of the Bidder.  \n \nGI10 (2010-01-11) Revision of bid  \n \n1. A bid submitted in accordance with these instructions may be revised by letter or facsimile provided the revision \nis received at the office designated for the receipt of bids, on or before the date and time set for the closing of \nthe solicitation. The letter or facsimile shall be on the Bidder's letterhead or bear a signature that identifies the \nBidder. \n2. A revision to a bid that includes unit prices must clearly identify the change(s) in the unit price(s) and the \nspecific item(s) to which each change applies. \n3. A letter or facsimile submitted to confirm an earlier revision should be clearly identified as a confirmation.  \n4. Failure to comply with any of the above provisions may result in the rejection of the non-compliant revision(s) \nonly. The bid shall be evaluated based on the original bid submitted and all other compliant revision(s).  \n \nGI11 (2014-09-25) Rejection of bid \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 30 of 32 \n \n1. Canada may accept any bid, whether it is the lowest or not, or may reject any or all bids.  \n2. Without limiting the generality of paragraph 1) of GI11, Canada may reject a bid if any of the following \ncircumstances is present:  \na. the Bidder's bidding privileges are suspended or are in the process of being suspended;  \nb. the bidding privileges of any employee or subcontractor included as part of the bid are suspended or \nare in the process of being suspended, which suspension or pending suspension would render that \nemployee or subcontractor ineligible to bid on the Work, or the portion of the Work the employee or \nsubcontractor is to perform; \nc. the Bidder is bankrupt, or where for whatever reason, its activities are rendered inoperable for an \nextended period; \nd. evidence, satisfactory to Canada, of fraud, bribery, fraudulent misrepresentation or failure to comply \nwith any law protecting individuals against any manner of discrimination, has been received with \nrespect to the Bidder, any of its employees or any subcontractor included as part of its bid; \ne. evidence satisfactory to Canada that based on past conduct or behavior, the Bidder, a sub -contractor or \na person who is to perform the Work is unsuitable or has conducted himself/herself improperly;  \nf. with respect to current or prior transactions with Canada  \ni. Canada has exercised, or intends to exercise, the contractual remedy of taking the work out of \nthe contractor's hands with respect to a contract with the Bidder, any of its employees or any \nsubcontractor included as part of its bid; or \nii. Canada determines that the Bidder's performance on other contracts is sufficiently poor to \njeopardize the successful completion of the requirement being bid on.  \n3. In assessing the Bidder's performance on other contracts pursuant to subparagraph  2)(f)(ii) of GI11, Canada \nmay consider, but not be limited to, such matters as:  \na. the quality of workmanship in performing the Work; \nb. the timeliness of completion of the Work; \nc. the overall management of the Work and its effect on the level of effort demanded of the department \nand its representative; and \nd. the completeness and effectiveness of the Contractor's safety program during the performance of the \nWork. \n4. Without limiting the generality of paragraphs 1), 2) and 3) of GI11, Canada may reject any bid based on an \nunfavourable assessment of the  \na. adequacy of the bid price to permit the work to be carried out and, in the case of a bid providing prices \nper unit, whether each such price reasonably reflects the cost of performing the part of the work to \nwhich that price applies; \nb. Bidder's ability to provide the necessary management structure, skilled personnel, experience and \nequipment to perform competently the work under the Contract; and  \nc. Bidder's performance on other contracts. \n5. Where Canada intends to reject a bid pursuant to a provision of paragraphs 1), 2), 3) or 4) of GI11, other than \nsubparagraph 2)(a) of GI11, the contracting Authority will inform the Bidder and provide the Bidder ten (10) days \nwithin which to make representations, before making a final decision on the bid rejection.  \n6. Canada may waive informalities and minor irregularities in bids received if Canada determines that the variation \nof the bid from the exact requirements set out in the Bid Documents can be corrected or waived without being \nprejudicial to other Bidders. \n \nGI12 (2015-02-25) Bid costs \n \nNo payment will be made for costs incurred in the preparation and submission of a bid in response to the bid solicitation. \nCosts associated with preparing and submitting a bid, as well as any costs incurred by the Bidder associated with the \nevaluation of the bid, are the sole responsibility of the Bidder. \n \n \nGI13 (2020-05-28) Procurement Business Number \n \nSuppliers are required to have a Procurement Business Number (PBN) before contract award. Suppliers may register \nfor a PBN online at Supplier Registration Information.  \n \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 31 of 32 \n \nGI14 (2013-04-25) Compliance with applicable laws \n \n1. By submission of a bid, the Bidder certifies that the Bidder has the legal capacity to enter into a contract and is \nin possession of all valid licences, permits, registrations, certificates, declarations, filings, or other authorizations \nnecessary to comply with all federal, provincial and municipal laws and regulations applicable to the submission \nof the bid and entry into any ensuing contract for the performance of the work.  \n2. For the purpose of validating the certification in paragraph 1) of GI14, a Bidder shall, if requested, provide a \ncopy of every valid licence, permit, registration, certificate, declaration, filing or other authorization listed in the \nrequest, and shall provide such documentation within the time limit(s) set out in the request.  \n3. Failure to comply with the requirements of paragraph 2) of GI14 shall result in disqualification of the bid. \n \nGI15 (2015-02-25) Approval of alternative materials  \n \nWhen materials are specified by trade names or trademarks, or by manufacturers' or suppliers' names, the bid shall be \nbased on use of the named materials. During the solicitation period, alternative materials may be considered provided \nfull technical data is received in writing by the Contracting Officer at least ten (10) calendar days prior to the solicitation \nclosing date. If the alternative materials are approved for the purposes of the bid, an addendum to the bid documents \nshall be issued. \n \nGI16 (2010-01-11) Performance evaluation  \n \n1. Bidders shall take note that the performance of the Contractor during and upon completion of the work shall be \nevaluated by Canada. The evaluation shall be based on the quality of workmanship; timeliness of completion of \nthe work; project management, contract management and management of health and safety. Should the \nContractor's performance be considered unsatisfactory, the Contractor's bidding privileges on future work may \nbe suspended indefinitely. \n2. The form PWGSC-TPSGC 2913, SELECT - Contractor Performance Evaluation Report Form, is used to record \nthe performance. \n \nGI17 (2011-05-16) Conflict of interest—unfair advantage \n \n1. In order to protect the integrity of the procurement process, bidders are advised that Canada may reject a bid in \nthe following circumstances:  \na. if the Bidder, any of its subcontractors, any of their respective employees or former employees was \ninvolved in any manner in the preparation of the bid solicitation or in any situation of conflict of interest \nor appearance of conflict of interest; \nb. if the Bidder, any of its subcontractors, any of their respective employees or former employees had \naccess to information related to the bid solicitation that was not available to other bidders and that \nwould, in Canada's opinion, give or appear to give the Bidder an unfair advantage. \n2. The experience acquired by a bidder who is providing or has provided the goods and services described in the \nbid solicitation (or similar goods or services) will not, in itself, be considered by Canada as conferring an unfair \nadvantage or creating a conflict of interest. This bidder remains however subject to the criteria established \nabove. \n3. Where Canada intends to reject a bid under this section, the Contracting Authority will inform the Bidder and \nprovide the Bidder an opportunity to make representations before making a final decision. Bidders who are in \ndoubt about a particular situation should contact the Contracting Authority before bid closing. By submitting a \nbid, the Bidder represents that it does not consider itself to be in conflict of interest nor to have an unfair \nadvantage. The Bidder acknowledges that it is within Canada's sole di scretion to determine whether a conflict of \ninterest, unfair advantage or an appearance of conflict of interest or unfair advantage exists.  \n \n \nGI18 (2022-01-28) Code of Conduct for Procurement—bid \n \nThe Code of Conduct for Procurement provides that Bidders must respond to bid solicitations in an honest, fair and \ncomprehensive manner, accurately reflect their capacity to satisfy the requirements set out in the bid solicitation and \nresulting contract, submit bids and enter into contracts only if they will fulfill all obligations of the Contract. By submitting \n\n \n \nSolicitation No. – Nº de l’invitation : \n30007094 \nPage 32 of 32 \n \na bid, the Bidder is certifying that it is complying with the Code of Conduct for Procurement.   Failure to comply with the \nCode of Conduct for Procurement may render the bid non-responsive.",
  "source": "bulk-pdf"
}
