{
  "id": "RFI W6381-26-0007 EN_0",
  "title": "RFI W6381 26 0007 EN 0",
  "procurement_method": "RFP",
  "buyer": {
    "name": "Parks Canada",
    "jurisdiction": "CA-federal"
  },
  "industry_tags": [
    "services"
  ],
  "summary": "UNCLASSIFIED / NON CLASSIFIÉ DEPARTMENT OF NATIONAL DEFENCE / CANADIAN ARMED FORCES (DND/CAF) REQUEST FOR INFORMATION (RFI) W6381-26-0007 To inform suppliers that the DND/CAF is implementing S1000D-compliant Interactive Electronic Technical…",
  "text": "UNCLASSIFIED / NON CLASSIFIÉ  \n  \nDEPARTMENT OF NATIONAL DEFENCE / CANADIAN ARMED FORCES (DND/CAF) \n \nREQUEST FOR INFORMATION (RFI) W6381-26-0007 \n \nTo inform suppliers that the DND/CAF is implementing S1000D-compliant Interactive Electronic \nTechnical Manuals \n \n \nPART I: REQUEST FOR INFORMATION PROCESS \n \n1. Nature of this Request for Information \nThis is not a bid solicitation. This is a Request for Information (RFI) only and does not constitute a \ncommitment, implied or otherwise, that the Department of National Defence / Canadian Armed \nForces (DND/CAF) will take procurement action in this matter. This RFI will not result in the award \nof any contract. This RFI will not result in the creation of any source list. Responding to this RFI \ndoes not guarantee to the suppliers an invitation for any future Requests for Proposals (RFP) \nissued or subsequent contracts. This RFI is simply intended to solicit feedback from industry with \nrespect to the subject matter described in this RFI. \n \n2. Nature and Format of Responses Requested \nRespondents are reminded that this is an RFI and not an RFP. As such, respondents are \nrequested to provide their comments, concerns and, where applicable, alternative \nrecommendations regarding how the requirements or objectives described in this RFI could be \nsatisfied. Respondents may provide their responses at any time up until the closing date. \nRespondents are also invited to provide comments regarding the content, format or organization \nof any draft documents included in this RFI. Respondents should explain any assumptions they \nmake in their responses. Any marketing or promotional information submitted as part of the \nresponses will not be reviewed. \nResponses will not be used for competitive or comparative evaluation purposes, and thus the \nresponse format is not as rigorously defined as would normally be for an RFP. However, for ease \nof use, Canada requests that respondents follow the structure outlined in section 7. \n \n3. Response Costs \nCanada will not reimburse any organization for expenses incurred in responding to this RFI \n \n4. Treatment of Responses \nUse of Responses: Responses will not be formally evaluated. However, the responses received \nmay be used by Canada to develop or modify procurement policies, requirements, or standards. \nCanada will review all responses received by the RFI closing date. Canada may, at its discretion, \nreview responses received after the RFI closing date. \nReview Team: A review team composed of representatives of DND will review the responses. \nCanada reserves the right to hire any independent consultant or to use any Government of \nCanada resources that it considers necessary to review any response. Not all members of the \nreview team will necessarily review all responses. \nConfidentiality: The Access to Information Act provides, upon request, a right of access to \ninformation in records under the control of a government institution. The general right of access is \nlimited by specified exclusions from disclosure. These exclusions include, among other things, \ncertain types of third-party information, the disclosure of which could be detrimental to that party. \n\nUNCLASSIFIED / NON CLASSIFIÉ  \n  \nRespondents are requested to indicate and mark any portions of their response that they consider \nproprietary or confidential. Canada will handle these portions in accordance with the Access to \nInformation Act. \nSharing of Information with Other Governments: There is no requirement currently to share \nresponses, however Canada reserves the right, if situations arise, to share some or all of the \ninformation collected in the process of this RFI with provincial, municipal, or international \ngovernments. \n \n5. Follow-up Activity \nCanada may, at its discretion, contact any respondent to follow up with additional questions or to \nclarify any aspect of a response. \n \n6. Contents of the RFI \nThe information contained in this document remains a work in progress and respondents should \nnot assume that none of the requirements will be deleted or revised. Comments regarding any \naspect of the draft documents are welcome. This RFI also contains specific questions addressed \nto the industry. \n \n7. Format of Responses \nCover Page: If the response includes multiple volumes, respondents are requested to indicate on \nthe front cover page of each volume the title of the response, the solicitation number, the volume \nnumber and the full legal name of the respondent. \nTitle Page: The first page after the cover page should be the title page, which should contain the \nfollowing information: \n(i) the title of the respondent’s response and the volume number; \n(ii) the name and address of the respondent; \n(iii) the name, address and telephone number of the respondent’s contact; \n(iv) the date, and \n(v) the RFI number. \nCanada requests that respondents submit their response in unprotected (i.e., no password) PDF \nformat by email, if the size of the document is less than 10MB, to DGMSSCProcurement-\nApprovisionnementDGSMCA@forces.gc.ca. \nA response that is larger than the maximum allowable size should be sent in multiple emails that \neach fall under the maximum allowable attachment size. \nResponses to this RFI may be in either of Canada’s official languages, English or French.  \nCanada requests that responses be strictly sent to the above email address, not by fax or mail. \n \n8. Submission of Responses \nTime and Place for Submission of Responses: Organizations interested in providing a \nresponse should deliver it to the Procurement Authority at the email address identified above no \nlater than 2:00 PM Eastern Standard Time, on 10 September 2025. \nResponsibility for Timely Delivery: Each respondent is solely responsible for ensuring its \nresponse is delivered on time to the correct email address. \nIdentification of Response: Each respondent should ensure that its name, return email address, \nthe solicitation number and the closing date appear clearly in the body of the response email. \n \n\nUNCLASSIFIED / NON CLASSIFIÉ  \n  \n9. Enquiries \nAll enquiries and other communications related to this RFI shall be directed exclusively to the DND \nProcurement Authority. Since this is not a bid solicitation, Canada will not necessarily respond to \nenquiries in writing or by circulating answers to all respondents; however, respondents with \nquestions regarding this RFI may direct their enquiries to: \n \nProcurement Authority: Kimberly Diep \nOrganization: Department of National Defence \nEmail address: DGMSSCProcurement-ApprovisionnementDGSMCA@forces.gc.ca \n \nPART II: REQUIREMENT \n \n1. Requirement Background \nS1000D is an international specification for the development and management of technical \npublications using a common source database. For more information on S1000D, please consult \nhttps://s1000d.org/. The implementation of the S1000D specification aims to improve efficiency, \nreduce costs, and ensure consistency across technical publications development and \nmanagement by enabling data reuse and module-based publishing. \nAn Interactive Electronic Technical Manual (IETM) is a set of information needed for the \ndescription, operation and maintenance of a product, optimally arranged and formatted for \ninteractive screen presentation to the end user on an electronic display system. DND has \nextensively revised the policy publication C-01-100-100/AG-006: Writing, Format, and Production \nof Technical Publications (CAN01100100-38905-AG006-00). This publication provides instructions \nfor the general content, formatting, development, and management for the CAF technical \npublications. It provides direction for producing non-S1000D technical publications and for \nS1000D-compliant IETM. \nThe Business Rules (BR) Matrix is intended as an Annex to C-01-100-100/AG-006.  The BR \nMatrix contains the rules for the DND layer Business Rules Decision Points (BRDP) that guide \nhow the S1000D specification is implemented within a project or organization. These decision \npoints cover various aspects of the specification, including authoring, illustrating, and interfacing \nwith other standards and business processes. The BR Matrix introduces the concept of layering \nthe BRs. Each layer of BRs inherits and extends the BRs from the previous layer(s). The BRs \ndefined in Layer 1 are defined in the S1000D specification itself. Layer 2 (DND) is the overarching \nlayer that defines the organizational BRs for the development and management of an IETM. For \neach of the layers below Layer 2, the number of possible remaining decisions decreases as \nillustrated in Fig. 1.  \n\nUNCLASSIFIED / NON CLASSIFIÉ  \n  \nFig. 1: Business Rules layers \n \nThe S1000D-compliant IETM could take effect as early as January 2026 and would apply to the \nprocurement of defence systems and equipment, and their corresponding IETM by DND. \n \n2. Objective of this RFI \nThe DND is launching this RFI on behalf of the Government of Canada to engage with and inform \nstakeholders of its implementation of S1000D-compliant IETM. \nThis RFI is being issued with the objective of: \n(i) informing suppliers that the DND/CAF is implementing S1000D-compliant Interactive \nElectronic Technical Manuals; and \n(ii) requesting detailed information and feedback from industry on how DND can provide \nflexibility to adapt Data Modules or content created in the objective to be published within \nDND. \nCanada may not use any of the feedback in the responses. Canada shall not be liable under any \ncircumstances to any supplier who has prepared a response to this RFI. \nThe option to update information is open to all respondents up to the time of the issuance of any \nfuture procurement documents. \n \n3. Security Requirements \nThere are no security requirements associated with responding to this RFI. \n \n4. Intellectual Property Requirements \nThere are no intellectual property requirements associated with this RFI. \n \n5. Engagement Approach \nThis RFI is the only planned engagement activity. \n \n\n\nUNCLASSIFIED / NON CLASSIFIÉ  \n  \nPART III: QUESTIONS TO INDUSTRY \n \nPlease refer to the description given in Part II and to the C-01-100-100/AG-006 policy and its \nBusiness Rules (BR) Matrix Annex. \n \nCanada is interested in receiving short written answers (e.g., short paragraphs or bullet points) to \nthe following questions: \n \nQuestion 1: Are the documents clear, understandable and unambiguous? \n• Is the language used in the documents clear and understandable for all stakeholders? \n• Are the instructions, business rules and guidelines organized logically and easy to \nnavigate?  \n \nQuestion 2: If you are unable to meet the requirements for S1000D-compliant IETM, please \nexplain why for each of the requirements that cannot be met.  \n \nQuestion 3: If you are already using S1000D in your organization, please explain how you would \nensure compliance with the documents if they are applied in a procurement. \n \nQuestion 4: If you are unable to meet the requirements for non-S1000D technical publications, \nplease explain why for each of the requirements that cannot be met.",
  "source": "web-upload"
}